zeha/xc32/pic32c-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/pic32cz1038ca70100.h
#define IROM_SIZE                      (0x00004000U)       /*   16kB Memory segment type: rom */
#define DTCM_SIZE                      (0x00020000U)       /*  128kB Memory segment type: other */
#define IRAM_SIZE                      (0x00060000U)       /*  384kB Memory segment type: ram */

#define PERIPHERALS_ADDR               (0x40000000U)       /**< PERIPHERALS base address (type: io)*/
#define SYSTEM_ADDR                    (0xe0000000U)       /**< SYSTEM base address (type: io)*/
#define QSPIMEM_ADDR                   (0x80000000U)       /**< QSPIMEM base address (type: other)*/
#define AXIMX_ADDR                     (0xa0000000U)       /**< AXIMX base address (type: other)*/
#define ITCM_ADDR                      (0x00000000U)       /**< ITCM base address (type: other)*/
#define IFLASH_ADDR                    (0x00400000U)       /**< IFLASH base address (type: flash)*/
#define IROM_ADDR                      (0x00800000U)       /**< IROM base address (type: rom)*/
#define DTCM_ADDR                      (0x20000000U)       /**< DTCM base address (type: other)*/
#define IRAM_ADDR                      (0x20400000U)       /**< IRAM base address (type: ram)*/

/* ************************************************************************** */
/**  DEVICE SIGNATURES FOR PIC32CZ1038CA70100                                 */
/* ************************************************************************** */
#define CHIP_JTAGID                    (0x05b3d03fUL)
#define CHIP_CIDR                      (0xa1020c00UL)
#define CHIP_EXID                      (0x00000001UL)

/* ************************************************************************** */
/**  ELECTRICAL DEFINITIONS FOR PIC32CZ1038CA70100 */
/* ************************************************************************** */
#define CHIP_FREQ_SLCK_RC_MIN               (20000UL)
#define CHIP_FREQ_SLCK_RC                   (32000UL)      /**< \brief Typical Slow Clock Internal RC frequency */
#define CHIP_FREQ_SLCK_RC_MAX               (44000UL)
#define CHIP_FREQ_MAINCK_RC_4MHZ          (4000000UL)
#define CHIP_FREQ_MAINCK_RC_8MHZ          (8000000UL)
#define CHIP_FREQ_MAINCK_RC_12MHZ        (12000000UL)
#define CHIP_FREQ_CPU_MAX               (300000000UL)
#define CHIP_FREQ_XTAL_32K                  (32768UL)
#define CHIP_FREQ_XTAL_12M               (12000000UL)
#define CHIP_FREQ_FWS_0                  (23000000UL)      /**< \brief Maximum operating frequency when FWS is 0 */
#define CHIP_FREQ_FWS_1                  (46000000UL)      /**< \brief Maximum operating frequency when FWS is 1 */
#define CHIP_FREQ_FWS_2                  (69000000UL)      /**< \brief Maximum operating frequency when FWS is 2 */
#define CHIP_FREQ_FWS_3                  (92000000UL)      /**< \brief Maximum operating frequency when FWS is 3 */
#define CHIP_FREQ_FWS_4                 (115000000UL)      /**< \brief Maximum operating frequency when FWS is 4 */
#define CHIP_FREQ_FWS_5                 (138000000UL)      /**< \brief Maximum operating frequency when FWS is 5 */
#define CHIP_FREQ_FWS_6                 (150000000UL)      /**< \brief Maximum operating frequency when FWS is 6 */
#define CHIP_FREQ_FWS_NUMBER                    (7UL)      /**< \brief Number of FWS ranges */

#ifdef __cplusplus
}
#endif

/** @}  end of PIC32CZ1038CA70100 definitions */


#endif /* _PIC32CZ1038CA70100_H_ */
